Repository: binz0209/CanPany
Catalog: CanPany-*/CanPany.Application/Resources/Messages.*.resx
Languages: vi

# Error.Common.NotFound
source: Resource not found
vi: Không tìm thấy tài nguyên

# Error.Common.Unauthorized
source: You are not authorized to perform this action
vi: Bạn không có quyền thực hiện hành động này

# Error.Common.InternalServerError
source: An unexpected error occurred. Please try again later.
vi: Đã xảy ra lỗi không mong muốn. Vui lòng thử lại sau.

# Error.Common.BadRequest
source: Invalid request
vi: Yêu cầu không hợp lệ

# Error.Common.ValidationFailed
source: Validation failed
vi: Xác thực thất bại

# Error.User.Register.EmailExists
source: Email '{0}' already exists
vi: Email '{0}' đã tồn tại

# Error.User.Register.Failed
source: Failed to register user: {0}
vi: Đăng ký người dùng thất bại: {0}

# Error.User.Login.InvalidCredentials
source: Invalid email or password
vi: Email hoặc mật khẩu không đúng

# Error.User.Login.Failed
source: Login failed: {0}
vi: Đăng nhập thất bại: {0}

# Error.User.NotFound
source: User with ID '{0}' not found
vi: Không tìm thấy người dùng với ID '{0}'

# Error.User.Update.Failed
source: Failed to update user
vi: Cập nhật người dùng thất bại

# Error.User.Delete.Failed
source: Failed to delete user
vi: Xóa người dùng thất bại

# Error.User.PasswordChange.Failed
source: Failed to change password: {0}
vi: Đổi mật khẩu thất bại: {0}

# Error.User.PasswordChange.OldPasswordIncorrect
source: Old password is incorrect
vi: Mật khẩu cũ không đúng

# Error.User.PasswordReset.EmailNotFound
source: Email does not exist in the system
vi: Email không tồn tại trong hệ thống

# Error.User.PasswordReset.CodeExpired
source: Verification code has expired
vi: Mã xác thực đã hết hạn

# Error.User.PasswordReset.CodeInvalid
source: Verification code is incorrect
vi: Mã xác thực không đúng

# Error.User.PasswordReset.EmailSendFailed
source: Failed to send email
vi: Không thể gửi email

# Validation.User.FullNameRequired
source: Full name is required
vi: Họ tên là bắt buộc

# Validation.User.EmailRequired
source: Email is required
vi: Email là bắt buộc

# Validation.User.EmailInvalid
source: Email format is invalid
vi: Định dạng email không hợp lệ

# Validation.User.PasswordRequired
source: Password is required
vi: Mật khẩu là bắt buộc

# Validation.User.PasswordMinLength
source: Password must be at least {0} characters
vi: Mật khẩu phải có ít nhất {0} ký tự

# Validation.User.UserIdRequired
source: User ID is required
vi: ID người dùng là bắt buộc

# Success.User.Register
source: User registered successfully
vi: Đăng ký người dùng thành công

# Success.User.Login
source: Login successful
vi: Đăng nhập thành công

# Success.User.Update
source: User updated successfully
vi: Cập nhật người dùng thành công

# Success.User.Delete
source: User deleted successfully
vi: Xóa người dùng thành công

# Success.User.PasswordChange
source: Password changed successfully
vi: Đổi mật khẩu thành công

# Success.User.PasswordReset.CodeSent
source: Verification code has been sent to your email
vi: Mã xác thực đã được gửi về email của bạn

# Success.User.PasswordReset.Reset
source: Password has been reset successfully
vi: Mật khẩu đã được đặt lại thành công

# Logging.User.Register.Start
source: Starting user registration for email: {0}
vi: Bắt đầu đăng ký người dùng với email: {0}

# Logging.User.Register.Complete
source: User registration completed for email: {0}, User ID: {1}
vi: Hoàn thành đăng ký người dùng với email: {0}, ID người dùng: {1}

# Logging.User.Login.Start
source: Starting login attempt for email: {0}
vi: Bắt đầu đăng nhập với email: {0}

# Logging.User.Login.Complete
source: Login successful for email: {0}, User ID: {1}
vi: Đăng nhập thành công với email: {0}, ID người dùng: {1}

# Logging.User.Update.Start
source: Starting user update for User ID: {0}
vi: Bắt đầu cập nhật người dùng với ID: {0}

# Logging.User.Update.Complete
source: User update completed for User ID: {0}
vi: Hoàn thành cập nhật người dùng với ID: {0}

# Logging.User.Delete.Start
source: Starting user deletion for User ID: {0}
vi: Bắt đầu xóa người dùng với ID: {0}

# Logging.User.Delete.Complete
source: User deletion completed for User ID: {0}
vi: Hoàn thành xóa người dùng với ID: {0}

# Logging.User.PasswordChange.Start
source: Starting password change for User ID: {0}
vi: Bắt đầu đổi mật khẩu cho người dùng với ID: {0}

# Logging.User.PasswordChange.Complete
source: Password change completed for User ID: {0}
vi: Hoàn thành đổi mật khẩu cho người dùng với ID: {0}

# Logging.User.PasswordReset.Request
source: Password reset requested for email: {0}
vi: Yêu cầu đặt lại mật khẩu cho email: {0}

# Logging.User.PasswordReset.Complete
source: Password reset completed for email: {0}
vi: Hoàn thành đặt lại mật khẩu cho email: {0}

# Error.Project.NotFound
source: Project with ID '{0}' not found
vi: Không tìm thấy dự án với ID '{0}'

# Error.Project.Create.Failed
source: Failed to create project: {0}
vi: Tạo dự án thất bại: {0}

# Error.Project.Update.Failed
source: Failed to update project: {0}
vi: Cập nhật dự án thất bại: {0}

# Error.Project.Delete.Failed
source: Failed to delete project: {0}
vi: Xóa dự án thất bại: {0}

# Error.Project.Unauthorized
source: You are not authorized to modify this project
vi: Bạn không có quyền chỉnh sửa dự án này

# Validation.Project.TitleRequired
source: Project title is required
vi: Tiêu đề dự án là bắt buộc

# Validation.Project.DescriptionRequired
source: Project description is required
vi: Mô tả dự án là bắt buộc

# Validation.Project.OwnerIdRequired
source: Project owner ID is required
vi: ID chủ sở hữu dự án là bắt buộc

# Validation.Project.ProjectIdRequired
source: Project ID is required
vi: ID dự án là bắt buộc

# Success.Project.Create
source: Project created successfully
vi: Tạo dự án thành công

# Success.Project.Update
source: Project updated successfully
vi: Cập nhật dự án thành công

# Success.Project.Delete
source: Project deleted successfully
vi: Xóa dự án thành công

# Logging.Project.Create.Start
source: Starting project creation, Title: {0}, Owner ID: {1}
vi: Bắt đầu tạo dự án, Tiêu đề: {0}, ID chủ sở hữu: {1}

# Logging.Project.Create.Complete
source: Project creation completed, Project ID: {0}, Title: {1}
vi: Hoàn thành tạo dự án, ID dự án: {0}, Tiêu đề: {1}

# Logging.Project.Update.Start
source: Starting project update for Project ID: {0}
vi: Bắt đầu cập nhật dự án với ID: {0}

# Logging.Project.Update.Complete
source: Project update completed for Project ID: {0}
vi: Hoàn thành cập nhật dự án với ID: {0}

# Logging.Project.Delete.Start
source: Starting project deletion for Project ID: {0}
vi: Bắt đầu xóa dự án với ID: {0}

# Logging.Project.Delete.Complete
source: Project deletion completed for Project ID: {0}
vi: Hoàn thành xóa dự án với ID: {0}

# Error.BackgroundJob.ProcessFailed
source: Background job processing failed: {0}
vi: Xử lý background job thất bại: {0}

# Error.BackgroundJob.HandlerNotFound
source: No handler found for job type: {0}
vi: Không tìm thấy handler cho loại job: {0}

# Logging.BackgroundJob.ProcessStart
source: Processing background job, Job ID: {0}, Job Type: {1}
vi: Đang xử lý background job, ID job: {0}, Loại job: {1}

# Logging.BackgroundJob.ProcessComplete
source: Background job completed successfully, Job ID: {0}
vi: Hoàn thành xử lý background job, ID job: {0}

# Logging.BackgroundJob.ProcessFailed
source: Background job processing failed, Job ID: {0}, Error: {1}
vi: Xử lý background job thất bại, ID job: {0}, Lỗi: {1}

# Status.Processing
source: Processing...
vi: Đang xử lý...

# Status.Completed
source: Completed
vi: Hoàn thành

# Status.Failed
source: Failed
vi: Thất bại

# Status.Pending
source: Pending
vi: Đang chờ
